app/controllers/admin_controller.rb

  def index
    #@books = Book.find_by_id('1')
     @books = Book.where(isbn: params[:search])
---
SELECT  "books".* FROM "books"  WHERE "books"."isbn" IS NULL LIMIT 1